# ðŸ§¾ San Francisco Employee Salary Analysis
**Author:** Masudur Rahman

**Tools:** Python, Pandas

In [1]:
import pandas as pd
data = pd.read_csv('Salaries.csv')

C:\Users\MASUDUR RAHMAN\AppData\Local\Temp\ipykernel_11860\2476971426.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv('Salaries.csv')

In [2]:
data_backup = data.copy()

In [3]:
data.head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

# Fixing data type error for columns:

In [5]:
cols = ['BasePay', 'OvertimePay', 'OtherPay']
for c in cols:
    data[c] = pd.to_numeric(data[c], errors = 'coerce')

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(6), int64(2), object(5)
memory usage: 14.7+ MB

In [7]:
data.describe()

,Id,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits,Year,Notes
count,148654.000000,148045.000000,148650.000000,148650.000000,148654.000000,148654.000000,148654.000000,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,74768.321972,93692.554811,2012.522643,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,50517.005274,62793.533483,1.117538,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-618.130000,-618.130000,2011.000000,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,36168.995000,44065.650000,2012.000000,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,71426.610000,92404.090000,2013.000000,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,105839.135000,132876.450000,2014.000000,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,567595.430000,567595.430000,2014.000000,NaN

## What is the average Basepay?

In [8]:
print('The Average Basepay :', data['BasePay'].mean())

The Average Basepay : 66325.4488404877

## What is the highest amount of overtimepay in the dataset?

In [9]:
data['OvertimePay'].max()

245131.88

## What is the job title of JOSEPH DRISCOLL?
## How much does JOSEPH DRISCOLL make(including benefits)?

In [10]:
data[data['EmployeeName']== 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [11]:
data[data['EmployeeName']== 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

## Who is the highest paid person?(including benefits)

In [12]:
print('The highest pay: ', data['TotalPayBenefits'].max())

The highest pay:  567595.43

In [13]:
print('The name of the person: ',data[data['TotalPayBenefits']== data['TotalPayBenefits'].max()]['EmployeeName'])

The name of the person:  0    NATHANIEL FORD
Name: EmployeeName, dtype: object

## Who is the lowest paid person(including benefits)? Do you notice something strange about how much he or she is paid()?

In [14]:
print('The lowest pay: ', data['TotalPayBenefits'].min())

The lowest pay:  -618.13

In [15]:
print("Truely strange! Oh____no! The salary is negative")

Truely strange! Oh____no! The salary is negative

In [16]:
print('The name of the person: ',data[data['TotalPayBenefits']== data['TotalPayBenefits'].min()]['EmployeeName'])

The name of the person:  148653    Joe Lopez
Name: EmployeeName, dtype: object

## What was the average Basepay of all employees per year?(2011-2014)

In [17]:
data.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [18]:
data['Year'].value_counts()

Year
2014    38123
2013    37606
2012    36766
2011    36159
Name: count, dtype: int64

In [19]:
data.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

## What was the maximum and minimum Basepay of all employees per year?(2011-2014)

In [20]:
data.groupby('Year')['BasePay'].agg(Max_BasePay='max', Min_BasePay='min')

      Max_BasePay  Min_BasePay
Year
2011    294580.02         0.00
2012    302578.00      -166.01
2013    319275.01        15.83
2014    318835.49         0.00

## How many unique job titles are there?

In [21]:
#data['JobTitle'].unique()
print('The number of total unique job titles : ', len(data['JobTitle'].unique()))

The number of total unique job titles :  2159

## What are the top 5 most common jobs?

In [22]:
data['JobTitle'].value_counts().head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

## How many Job Titles wre represented by only one person in 2013?

In [23]:
sum(data[data['Year']==2013]['JobTitle'].value_counts() == 1 )

202

## How many have the word CAPTAIN in their job title?

In [24]:
data.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

In [25]:
sum(data['JobTitle'].str.contains('CAPTAIN', case = False))

552

## Top Earners by Year and Job Title

In [26]:
data.groupby(['Year','JobTitle'])[['TotalPayBenefits','EmployeeName']].max()

                                     TotalPayBenefits       EmployeeName
Year JobTitle
2011 ACCOUNT CLERK                           60838.20        ZAIRE EARBY
     ACCOUNTANT                              65392.01      ROSALINDA TAN
     ACCOUNTANT INTERN                       58799.53        YUMING CHEN
     ACUPUNCTURIST                           67594.40             WEN XU
     ADMINISTRATIVE ANALYST                  79754.03       XIANG AMY LI
...                                               ...                ...
2014 Wire Rope Cable Maint Sprv             228338.09     Nelson E Aceto
     Worker's Comp Supervisor 1             145106.26  Timothy P O'Brien
     Worker's Compensation Adjuster         148584.41      Winfield Jung
     X-Ray Laboratory Aide                  129044.16         Zhe J Chen
     Youth Comm Advisor                      52011.19       Phimy Truong

[4137 rows x 2 columns]